Tekla Open API Reference for Tekla Structures 2025
ConnectionMarkPropertyElementTypes Methods
The PropertyElement.PropertyElementType.ConnectionMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
Code
Returns the code property element type.
ConnectionError
Returns the connection error property element type.
ConnectionNumber
Returns the connection number property element type.
DSTVCode
Returns the DSTV code property element type.
Group
Returns the group property element type.
Name
Returns the name property element type.
RunningNumber
Returns the running number property element type.
Top
See Also
Reference
PropertyElement.PropertyElementType.ConnectionMarkPropertyElementTypes Class
Tekla.Structures.Drawing Namespace